### <font color=cyan>MICROSOFT MOVIE STUDIO: MOVIE ANALYSIS</font>

![movie_analysis](img-1.png)

## Introduction

Microsoft aims to break into the cinematic market with a strategic approach. As a data analyst for their new movie studio, my role is to identify popular films and analyze their return on investment, determine which studios are associated with these popular movies, and highlight production costs.

## Business problem
Despite Microsoft's extensive experience in technology and software, the company lacks expertise in the film industry. To ensure a successful entry into the cinematic market, Microsoft needs to understand which types of films are currently excelling. This involves:-

- identify popular films and associated original languages.
- identify competitor studios currently in the market.
- Identifying high-performing genres.
- Identify movies with the highest rating.
- Analyzing the associated costs film that resonate with audiences and deliver a strong return on investment.

This requires a detailed analysis to minimize risks and maximize the potential for success in the highly competitive movie

## Data understanding
For this analysis, I have been provided with various datasets to work on. As a data analyst, I will load these datasets to get a glimpse of each and decide which one I will use to answer the business problem.

- <font color=cyan>tmdb.movie</font>- This dataset provides insights into the film popularity, original language, and  dates of different film.
- <font color=cyan>bom.movie_gross</font>-This datasets helps identify top performing studios.
- <font color=cyan>im.db</font>-This datasets helps identify popular genre.
- <font color=cyan>m.movie_budget</font>-This dataset gives details on costs such as production, domestic and foreign which facilitates on the analysis  of return of investments on particular films.

## Loading data for  cleaning and analysis

Before I begin data cleaning and analysis, I will import the necessary libraries to facilitate my work. I will then load the identified datasets to get an initial overview of the data in each table. This preliminary step will help me determine which datasets should be merged, ultimately saving time on cleaning individual datasets and enabling a more efficient and comprehensive analysis.

In [423]:
#importing all necessary libraries for my analysis.

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import sqlite3

In [424]:
#dataloading 
#loading budget.csv dataset

df1 = pd.read_csv(r'moviedata\zippedData\tn.movie_budgets.csv\tn.movie_budgets.csv')
df1.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [425]:
#dataloading 
#loading budget.csv dataset
df2 = pd.read_csv(r'moviedata\zippedData\bom.movie_gross.csv\bom.movie_gross.csv')
df2.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

Domestics gross column which is common in both df_1 and df_2. Although the values may seem different due to domestic gross on df_1 having the "$". I will first remove the dolar sign from this column and round to the nearest (-6), to march the values of df_2 as illustrated below.

In [426]:
#removing the "$" from the values in the domestic gross collumn of df_1
df1[['production_budget','domestic_gross','worldwide_gross']] = df1[['production_budget','domestic_gross','worldwide_gross']].apply(lambda x: pd.to_numeric(x.str.replace('[$,]', '')))
df1.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [427]:
#rounding off the results to the nearest (-6)

df1['domestic_gross'] = (df1['domestic_gross'] / 1000000).round() * 1000000
df1.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,761000000.0,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,43000000.0,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620000000.0,1316721747

Having succesfully achived this, i will now rename the title on df_2 to movie, to corresponse with the movie column in df_1.

In [428]:
df2.rename(columns={"title":"movie"}, inplace=1)
df2.head()

,movie,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [429]:
df2["domestic_gross"].round(-6)
df2

,movie,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

After stanadizing the two datasets, I will proceed on merging df_1 and df_ 2 using an inner merge. which is the Best type of join for finding common records between the two datasets. My aim is to find cost gross, foregn, production and worldwide gross associate with films and studios.

For a qualitative analysis, I will proceed by merging df1 and df2 based on the id column. This approach will not only reduce the time required for analysis but also underscore the importance of integrating datasets. By merging the datasets, we can leverage a more comprehensive dataset, allowing for a deeper and more accurate analysis of the data.

In [430]:
df1_df2_merged= pd.merge(df1, df2, on='movie', how='inner')
df1_df2_merged

,id,release_date,movie,production_budget,domestic_gross_x,worldwide_gross,studio,domestic_gross_y,foreign_gross,year
0,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875,BV,241100000.0,804600000,2011
1,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963,BV,459000000.0,946400000,2015
2,7,"Apr 27, 2018",Avengers: Infinity War,300000000,679000000.0,2048134200,BV,678800000.0,"1,369.50",2018
3,9,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,229000000.0,428900000,2017
4,10,"Nov 6, 2015",Spectre,300000000,200000000.0,879620923,Sony,200100000.0,680600000,2015
...,...,...,...,...,...,...,...,...,...,...
1242,68,"Apr 27, 2012",Sound of My Voice,135000,0.0,429448,FoxS,408000.0,NaN,2012
1243,73,"Jun 15, 2012",Your Sister's Sister,120000,2000000.0,3090593,IFC,1600000.0,NaN,2012
1244,80,"Jul 10, 2015",The Gallows,100000,23000000.0,41656474,WB (NL),22800000.0,20200000,2015
1245,86,"Jul 7, 2017",A Ghost Story,100000,2000000.0,2769782,A24,1600000.0,NaN,2017
1246,18,"Nov 12, 2010",Tiny Furniture,50000,0.0,424149,IFC,392000.0,NaN,2010

In [431]:
#dropping dupplicate collumn form the merged dataset

df1_df2_merged.drop(columns=['domestic_gross_y'], axis=1, inplace=True)

In [432]:
#running cells after dropping the duplicate column
df1_df2_merged.head()

,id,release_date,movie,production_budget,domestic_gross_x,worldwide_gross,studio,foreign_gross,year
0,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875,BV,804600000,2011
1,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963,BV,946400000,2015
2,7,"Apr 27, 2018",Avengers: Infinity War,300000000,679000000.0,2048134200,BV,"1,369.50",2018
3,9,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017
4,10,"Nov 6, 2015",Spectre,300000000,200000000.0,879620923,Sony,680600000,2015

In [433]:
#dataloading 
#loading budget.csv dataset
df3 = pd.read_csv(r'moviedata\zippedData\tmdb.movies.csv\tmdb.movies.csv')
df3.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [434]:
#renaming title to movie.
df3.rename(columns={"title":"movie"},inplace=True)
df3.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,movie,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [441]:
#merging the merged_cost dataset with the df_3 dataset
df1_df2_df3_merged= pd.merge(df1_df2_merged, df3, on='movie', how='inner')
df1_df2_df3_merged.head()

,id_x,release_date_x,movie,production_budget,domestic_gross_x,worldwide_gross,studio,foreign_gross,year,Unnamed: 0,genre_ids,id_y,original_language,original_title,popularity,release_date_y,vote_average,vote_count
0,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875,BV,804600000,2011,2470,"[12, 28, 14]",1865,en,Pirates of the Caribbean: On Stranger Tides,30.579,2011-05-20,6.4,8571
1,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963,BV,946400000,2015,14169,"[28, 12, 878]",99861,en,Avengers: Age of Ultron,44.383,2015-05-01,7.3,13457
2,7,"Apr 27, 2018",Avengers: Infinity War,300000000,679000000.0,2048134200,BV,"1,369.50",2018,23811,"[12, 28, 14]",299536,en,Avengers: Infinity War,80.773,2018-04-27,8.3,13948
3,9,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,20623,"[28, 12, 14, 878]",141052,en,Justice League,34.953,2017-11-17,6.2,7510
4,9,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,23830,"[28, 12, 14, 878]",141052,en,Justice League,34.953,2017-11-17,6.2,7510

From the output produced from merging my three datasets. I will perform the following data techniques to give a more correct vizualization for the analysis.
Here are the listed cleaning techniques that i will employ.
- Changing the name of my entire dataframe.
- Dropping dupicated and unnecessary columns.
- Renaming columns.
- Case convrsion.
- checking for empty rows

In [443]:
df1_df2_df3_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1395 entries, 0 to 1394
Data columns (total 18 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_x               1395 non-null   int64
 1   release_date_x     1395 non-null   object
 2   movie              1395 non-null   object
 3   production_budget  1395 non-null   int64
 4   domestic_gross_x   1395 non-null   float64
 5   worldwide_gross    1395 non-null   int64
 6   studio             1394 non-null   object
 7   foreign_gross      1200 non-null   object
 8   year               1395 non-null   int64
 9   Unnamed: 0         1395 non-null   int64
 10  genre_ids          1395 non-null   object
 11  id_y               1395 non-null   int64
 12  original_language  1395 non-null   object
 13  original_title     1395 non-null   object
 14  popularity         1395 non-null   float64
 15  release_date_y     1395 non-null   object
 16  vote_average       1395 non-null   float64
 17  vote_count         1395 non-null   int64
dtypes: float64(3), int64(7), object(8)
memory usage: 207.1+ KB

In [446]:
#dropping unecessary columns

df1_df2_df3_merged.drop(columns=["id_x", "Unnamed: 0", "genre_ids", "id_y", "original_title", "release_date_y"], inplace=True)
df = df1_df2_df3_merged
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1395 entries, 0 to 1394
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date_x     1395 non-null   object
 1   movie              1395 non-null   object
 2   production_budget  1395 non-null   int64
 3   domestic_gross_x   1395 non-null   float64
 4   worldwide_gross    1395 non-null   int64
 5   studio             1394 non-null   object
 6   foreign_gross      1200 non-null   object
 7   year               1395 non-null   int64
 8   original_language  1395 non-null   object
 9   popularity         1395 non-null   float64
 10  vote_average       1395 non-null   float64
 11  vote_count         1395 non-null   int64
dtypes: float64(3), int64(4), object(5)
memory usage: 141.7+ KB

In [452]:
#renaming columns
df.rename(columns={"release_date_x": "release_date", "domestic_gross_x": "domestic_gross"}, inplace=True)
df.head()

,Release_date,Movie,Production_budget,Domestic_gross,Worldwide_gross,Studio,Foreign_gross,Year,Original_language,Popularity,Vote_average,Vote_count
0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875,BV,804600000,2011,en,30.579,6.4,8571
1,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963,BV,946400000,2015,en,44.383,7.3,13457
2,"Apr 27, 2018",Avengers: Infinity War,300000000,679000000.0,2048134200,BV,"1,369.50",2018,en,80.773,8.3,13948
3,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,en,34.953,6.2,7510
4,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,en,34.953,6.2,7510

In [450]:
#performing case conversion
#converting all my column name from lowercase to upper case.
df.columns = [col.capitalize() for col in df.columns]
df.head()

,Release_date,Movie,Production_budget,Domestic_gross,Worldwide_gross,Studio,Foreign_gross,Year,Original_language,Popularity,Vote_average,Vote_count
0,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241000000.0,1045663875,BV,804600000,2011,en,30.579,6.4,8571
1,"May 1, 2015",Avengers: Age of Ultron,330600000,459000000.0,1403013963,BV,946400000,2015,en,44.383,7.3,13457
2,"Apr 27, 2018",Avengers: Infinity War,300000000,679000000.0,2048134200,BV,"1,369.50",2018,en,80.773,8.3,13948
3,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,en,34.953,6.2,7510
4,"Nov 17, 2017",Justice League,300000000,229000000.0,655945209,WB,428900000,2017,en,34.953,6.2,7510

In [453]:
df_4 = pd.read_csv(r'moviedata\zippedData\rt.movie_info.tsv\rt.movie_info.tsv',sep="\t")
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [ ]:
conn = sqlite3.connect(r'moviedata\zippedData\im.db\im.db')
cur = conn.cursor()

In [ ]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
table_names = cur.fetchall()
table_names

In [ ]:

movie_basics=pd.read_sql( """SELECT*
                    FROM Movie basic;
                """,conn)


directors=pd.read_sql( """SELECT*
                    FROM directors;
                """,conn)


known_for=pd.read_sql( """SELECT*
                    FROM known_for;
                """,conn)

movie_akas=pd.read_sql( """SELECT*
                    FROM movie_akas;
                """,conn)

movie_ratings=pd.read_sql( """SELECT*
                    FROM movie_ratings;
                """,conn)

persons=pd.read_sql( """SELECT*
                    FROM persons;
                """,conn)

principals=pd.read_sql( """SELECT*
                    FROM principals;
                """,conn)
writers=pd.read_sql( """SELECT*
                    FROM writers;
                """,conn)

In [ ]:
movie_basics.head()

In [ ]:
directors.head()

In [ ]:
known_for.head()

In [ ]:
movie_akas.head()

In [ ]:
persons.head()

In [ ]:
principals.head()

In [ ]:
writers.head()

### <font color=gray>Data inspection</font>
After data has been loaded successfully, inspecting the dataset is a crutial step in data cleaning.
Inspection allows us to have information on the following to make our analysis better.
- Dataset range
- Total number of columns
- Total number of rows
- Datatype for each column.

In [ ]:
#running code for data inspection
df1.info()

Having gotten the structure of the dataset, I will dig deeper into the dataset to check whether the column names accurately describe the data.

In [ ]:
#checking the first five rows of the dataset
df1.head()

From the output produced we can determine some data cleaning to employ to standardize our dataset. This are:-
- Dropping duplicate columns
- Renaming columns.
- splitting column
- perfoming case conversion.
- checking for missing values

In [ ]:
#droping duplicate column
df1.drop(columns=["Unnamed: 0","original_title"], axis=1,inplace=True)

In [ ]:
df1.head()

In [ ]:
#splitting the date column to get year
df1["Year"] = df1['release_date'].str[:4]
df1.head()

In [ ]:
#performing case conversion
#converting all my column name from lowercase to upper case.
df1.columns = [col.capitalize() for col in df1.columns]
df1.head()

In [ ]:
#renaming columns
df1.rename(columns={"Title":"Movie_title"}, inplace=True)
df1.head()

In [ ]:
#checking for missing values
df1.isna().sum()

The above output shows that our data has no missing values.

### <font color=gray>Data Analyisis</font>
With the cleaned data, we can note determine,
- popular movie title and factor contributing to popularity(language)
- Original langage of most voted movies
- Year with the most released movies

In [ ]:
#merging director and persons
director_person_writer_merged = pd.merge(directors, persons, on="person_id",how="inner")

In [ ]:
director_person_writer_merged.head()

In [ ]:
person_writer_merged = pd.merge(persons,writers , on="person_id",how="inner")
person_writer_merged.head()

In [ ]:
writers.head()

In [ ]:
movie_ratings.head()

In [ ]:
movie_akas.head()

In [ ]:
principals.head()

In [ ]:
known_for.head()

In [ ]:
df1.head()

In [ ]:
df4.columns